app/views/books/index.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                  <%= link_to book_favorites_path(book), class: "text-danger", method: :delete do %>
                    <i class="fas fa-heart"></i><%= book.favorites.count %>

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
              <td>
                コメント数：<%= book.book_comments.count %>