app/controllers/books_controller.rb

  def index
    @user = current_user
    @books = Book.all
---
SELECT "books".* FROM "books"

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      flash[:notice] = "You have created book successfully."
      redirect_to book_path(@book.id)
    else
      @user = current_user
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "zjn0k"], ["body", "y4qrdxgg7meo7n0gda5e"], ["user_id", 2], ["created_at", "2022-06-08 08:08:05.088585"], ["updated_at", "2022-06-08 08:08:05.088585"]]
SELECT "books".* FROM "books"

  def show
    @book_new = Book.new
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]