app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aa"], ["body", "aa"], ["user_id", 1], ["created_at", "2022-04-28 11:26:32.886803"], ["updated_at", "2022-04-28 11:26:32.886803"]]

  def show
    @book_new = Book.new
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]