app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @user = current_user
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @books = @user.books.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "x5d0b7bbm"], ["introduction", "a8udspttiumwctgbalf"], ["updated_at", "2022-06-08 08:08:08.101224"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)