app/models/user.rb

INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 1], ["followed_id", 2], ["created_at", "2023-04-19 04:40:25.995393"], ["updated_at", "2023-04-19 04:40:25.995393"]]
---
  def follow(user)
    relationships.create(followed_id: user.id)